package osy.kcg.mykotlin

open class RV {
    var serverUrl= ""
    var saveUrlJsp=""
    var imageUploadUrlJsp =""

    var timeStamp =""
    var address =""
    var latitude =""
    var longitude ="";
    var fm1_tnsckfwkdth = ""
    var fm1_tnsckfwkdth_auto = ""
    var fm2_rndur = ""
    var fm3_wkdth = ""
    var fm4_tltjf = ""
    var fm4_tltjf_check = ""
    var phoneNo = ""
    var phoneName = ""
    var imageName = ""


    var savePointUrlJsp = ""
    var ka_name = ""
    var ka_pname = ""
    var ka_type = ""
    var ka_upTime = ""
    var ka_point = ""

    private val AllpName = arrayOf("본청", "감천", "감포", "강구", "강동", "강릉", "강화", "거문", "거제남부", "거진", "고성", "고창", "고현", "광안리", "광양", "구룡포", "기장", "나로도", "낙산", "남항", "남해", "노량", "노화", "녹동", "다대", "당진", "대명", "대부", "대산", "대천", "대청", "돌산", "땅끝", "마검포", "마량", "마산", "명지", "모항", "묵호", "방어진", "백령", "변산", "봉산", "북항", "비응", "사천", "삼척", "새만금", "서귀포", "서산", "성산", "속초", "송정", "신안", "신진", "신항만", "신항", "안산", "연평", "영광", "영도", "영일만", "영흥", "오천", "완도", "울릉", "울산항", "위도", "인항", "임원", "장승포", "장항", "제주", "주문진", "죽변", "지도", "진도", "진하", "진해", "추자", "축산", "통영", "평택", "포항", "하늘바다", "학암포", "한림", "해망", "호미곶", "홍성", "홍원", "화순", "회진", "후포", "흑산")
    //private val AllpName = arrayOf("감천파출소", "감포파출소", "강구파출소", "강동파출소", "강릉파출소", "강화파출소", "거문파출소", "거제남부파출소", "거진파출소", "고성파출소", "고창파출소", "고현파출소", "광안리파출소", "광양파출소", "구룡포파출소", "기장파출소", "김포파출소", "나로도파출소", "낙산파출소", "남항파출소", "남해파출소", "노량파출소", "노화파출소", "녹동파출소", "다대파출소", "당진파출소", "대부파출소", "대산파출소", "대천파출소", "대청파출소", "대포파출소", "돌산파출소", "땅끝파출소", "마량파출소", "마산파출소", "명지파출소", "모항파출소", "묵호파출소", "방어진파출소", "백령파출소", "변산파출소", "봉산파출소", "북항파출소", "비응파출소", "사천파출소", "삼척파출소", "새만금파출소", "서귀포파출소", "서산파출소", "성산파출소", "속초파출소", "송정파출소", "신진파출소", "신항광역파출소", "신항만파출소", "안면파출소", "안산파출소", "연평파출소", "영광파출소", "영도파출소", "영일만파출소", "영흥파출소", "오천파출소", "온산파출소", "완도파출소", "울릉파출소", "울산항파출소", "위도파출소", "인항파출소", "임원파출소", "장승포파출소", "장항파출소", "정서진파출소", "제주파출소", "주문진파출소", "죽변파출소", "지도파출소", "진도파출소", "진하파출소", "진해파출소", "추자파출소", "축산파출소", "통영파출소", "평택파출소", "포항파출소", "하늘바다파출소", "학암포파출소", "한강파출소", "한림파출소", "해망파출소", "호미곶파출소", "홍성파출소", "홍원파출소", "화순파출소", "회진파출소", "후포파출소", "흑산파출소")
    fun getAllpName() = AllpName

}